RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Includes/Library_Files/stm32l4xx_rcc.h
/**
  ******************************************************************************
  * @file    stm32l4xx_rcc.h
  * @author  MCD Application Team
  * @version VX.Y.Z (Start from version V1.0.0)
  * @date    DD-Month-YYYY
  * @brief   This file contains all the functions prototypes for the RCC firmware library.  
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32L4xx_RCC_H
#define __STM32L4xx_RCC_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx.h"

/** @addtogroup STM32L4xx_StdPeriph_Driver
  * @{
  */

/** @addtogroup RCC
  * @{
  */ 

/* Exported types ------------------------------------------------------------*/
typedef struct
{
  uint32_t SYSCLK_Frequency; 
  uint32_t HCLK_Frequency;  
  uint32_t PCLK1_Frequency; 
  uint32_t PCLK2_Frequency; 
  uint32_t I2C1CLK_Frequency;  
  uint32_t I2C2CLK_Frequency;
  uint32_t I2C3CLK_Frequency;
  uint32_t USART1CLK_Frequency;
  uint32_t USART2CLK_Frequency;
  uint32_t USART3CLK_Frequency;
  uint32_t UART4CLK_Frequency;
  uint32_t UART5CLK_Frequency;
  uint32_t LPUARTCLK_Frequency;   
}RCC_ClocksTypeDef;

/* Exported constants --------------------------------------------------------*/

/** @defgroup RCC_Exported_Constants
  * @{
  */
  
/** @defgroup RCC_HSE_configuration 
  * @{
  */
#define RCC_HSE_OFF                      ((uint8_t)0x00)
#define RCC_HSE_ON                       ((uint8_t)0x01)
#define RCC_HSE_Bypass                   ((uint8_t)0x05)
#define IS_RCC_HSE(HSE) (((HSE) == RCC_HSE_OFF) || ((HSE) == RCC_HSE_ON) || \
                         ((HSE) == RCC_HSE_Bypass))
/**
  * @}
  */ 
  
/** @defgroup RCC_PLL_Clock_Source 
  * @{
  */
#define RCC_PLLSource_MSI                ((uint32_t)0x00000001)
#define RCC_PLLSource_HSI                ((uint32_t)0x00000002)
#define RCC_PLLSource_HSE                ((uint32_t)0x00000003)


#define IS_RCC_PLL_SOURCE(SOURCE) (((SOURCE) == RCC_PLLSource_MSI) || \
                                   ((SOURCE) == RCC_PLLSource_HSI) || \
                                   ((SOURCE) == RCC_PLLSource_HSE))
    
/**
  * @}
  */ 

/** @defgroup RCC_MSI_Clock_Range 
  * @{
  */

#define RCC_MSIRange_0                   RCC_CR_MSIRANGE_0 /*!< MSI = 100 KHz  */
#define RCC_MSIRange_1                   RCC_CR_MSIRANGE_1 /*!< MSI = 200 KHz  */
#define RCC_MSIRange_2                   RCC_CR_MSIRANGE_2 /*!< MSI = 400 KHz  */
#define RCC_MSIRange_3                   RCC_CR_MSIRANGE_3 /*!< MSI = 800 KHz  */
#define RCC_MSIRange_4                   RCC_CR_MSIRANGE_4 /*!< MSI = 1 MHz    */
#define RCC_MSIRange_5                   RCC_CR_MSIRANGE_5 /*!< MSI = 2 MHz    */
#define RCC_MSIRange_6                   RCC_CR_MSIRANGE_6 /*!< MSI = 4 MHz    */
#define RCC_MSIRange_7                   RCC_CR_MSIRANGE_7 /*!< MSI = 8 MHz    */
#define RCC_MSIRange_8                   RCC_CR_MSIRANGE_8 /*!< MSI = 16 MHz   */
#define RCC_MSIRange_9                   RCC_CR_MSIRANGE_9 /*!< MSI = 24 MHz   */
#define RCC_MSIRange_10                  RCC_CR_MSIRANGE_10 /*!< MSI = 32 MHz  */
#define RCC_MSIRange_11                  RCC_CR_MSIRANGE_11 /*!< MSI = 48 MHz  */



#define IS_RCC_MSI_CLOCK_RANGE(RANGE) (((RANGE) == RCC_MSIRange_0) || \
                                       ((RANGE) == RCC_MSIRange_1) || \
                                       ((RANGE) == RCC_MSIRange_2) || \
                                       ((RANGE) == RCC_MSIRange_3) || \
                                       ((RANGE) == RCC_MSIRange_4) || \
                                       ((RANGE) == RCC_MSIRange_5) || \
                                       ((RANGE) == RCC_MSIRange_6) || \
                                       ((RANGE) == RCC_MSIRange_7) || \
                                       ((RANGE) == RCC_MSIRange_8) || \
                                       ((RANGE) == RCC_MSIRange_9) || \
                                       ((RANGE) == RCC_MSIRange_10) || \
                                       ((RANGE) == RCC_MSIRange_11))


/**
  * @}
  */ 

/** @defgroup RCC_PLL_Clock_Factors 
  * @{
  */
#define IS_RCC_PLLM_VALUE(VALUE) ((VALUE) <= 8)
#define IS_RCC_PLLN_VALUE(VALUE) ((8 <= (VALUE)) && ((VALUE) <= 86))
#define IS_RCC_PLLP_VALUE(VALUE) (((VALUE) == 7) || ((VALUE) == 17) )
#define IS_RCC_PLLQ_VALUE(VALUE) (((VALUE) == 2 ) || ((VALUE) == 4) || \
                                 ((VALUE) == 6)  || ((VALUE) == 8))
#define IS_RCC_PLLR_VALUE(VALUE) (((VALUE) == 2 ) || ((VALUE) == 4) || \
                                 ((VALUE) == 6)  || ((VALUE) == 8))
/**
  * @}
  */ 


/** @defgroup RCC_PLL_Clock_Output 
  * @{
  */
#define RCC_PLLCLk_P             ((uint32_t)0x00000000)
#define RCC_PLLCLk_Q             ((uint32_t)0x00000010)
#define RCC_PLLCLk_R             ((uint32_t)0x00000020)

#define IS_RCC_PLLCLOCKOUT_VALUE(VALUE) (((VALUE) == RCC_PLLCLk_P ) || ((VALUE) == RCC_PLLCLk_R) || \
                                             ((VALUE) == RCC_PLLCLk_Q))

/**                                                                     
  * @}
  */ 


/** @defgroup RCC_PLLSAI1_Clock_Factors 
  * @{
  */
#define IS_RCC_PLLSAI1N_VALUE(VALUE) ((8 <= (VALUE)) && ((VALUE) <= 86))
#define IS_RCC_PLLSAI1P_VALUE(VALUE) (((VALUE) == 7) || ((VALUE) == 17) )
#define IS_RCC_PLLSAI1Q_VALUE(VALUE) (((VALUE) == 2 ) || ((VALUE) == 4) || \
                                     ((VALUE) == 6)  || ((VALUE) == 8))
#define IS_RCC_PLLSAI1R_VALUE(VALUE) (((VALUE) == 2 ) || ((VALUE) == 4) || \
                                     ((VALUE) == 6)  || ((VALUE) == 8))

/**                                                                     
  * @}
  */ 
  
/** @defgroup RCC_PLLSAI1_Clock_Output 
  * @{
  */
#define RCC_PLLSAI1CLk_P             ((uint32_t)0x00000000)
#define RCC_PLLSAI1CLk_Q             ((uint32_t)0x00000010)
#define RCC_PLLSAI1CLk_R             ((uint32_t)0x00000020)

#define IS_RCC_PLLSAI1CLOCKOUT_VALUE(VALUE) (((VALUE) == RCC_PLLSAI1CLk_P ) || ((VALUE) == RCC_PLLSAI1CLk_R) || \
                                                 ((VALUE) == RCC_PLLSAI1CLk_Q))

/**                                                                     
  * @}
  */ 
/** @defgroup RCC_PLLSAI2_Clock_Factors 
  * @{
  */
#define IS_RCC_PLLSAI2N_VALUE(VALUE) ((8 <= (VALUE)) && ((VALUE) <= 86))
#define IS_RCC_PLLSAI2P_VALUE(VALUE) (((VALUE) == 7) || ((VALUE) == 17) )
#define IS_RCC_PLLSAI2Q_VALUE(VALUE) (((VALUE) == 2 ) || ((VALUE) == 4) || \
                                     ((VALUE) == 6)  || ((VALUE) == 8))
#define IS_RCC_PLLSAI2R_VALUE(VALUE) (((VALUE) == 2 ) || ((VALUE) == 4) || \
                                     ((VALUE) == 6)  || ((VALUE) == 8))


/**                                                                     
  * @}
  */ 

/** @defgroup RCC_PLLSAI2_Clock_Output 
  * @{
  */
#define RCC_PLLSAI2CLk_P             ((uint32_t)0x00000000)
#define RCC_PLLSAI2CLk_Q             ((uint32_t)0x00000010)
#define RCC_PLLSAI2CLk_R             ((uint32_t)0x00000020)


