RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Includes/Library_Files/stm32l4xx_rcc.h
#define IS_RCC_PLLSAI2CLOCKOUT_VALUE(VALUE) (((VALUE) == RCC_PLLSAI2CLk_P ) || ((VALUE) == RCC_PLLSAI2CLk_R) || \
                                                 ((VALUE) == RCC_PLLSAI2CLk_Q))

/**                                                                     
  * @}
  */ 

/** @defgroup RCC_STOPWUP_Clock_Source 
  * @{
  */
#define RCC_STOPWUCK_MSI             ((uint32_t)0x00000000)
#define RCC_STOPWUCK_HSI             ((uint32_t)0x00000001)


#define IS_RCC_STOPWUP_VALUE(VALUE) (((VALUE) == RCC_STOPWUCK_MSI ) || ((VALUE) == RCC_STOPWUCK_HSI))
                                                

/**                                                                     
  * @}
  */ 
/** @defgroup RCC_System_Clock_Source 
  * @{
  */
#define RCC_SYSCLKSource_MSI             ((uint32_t)0x00000000)
#define RCC_SYSCLKSource_HSI             ((uint32_t)0x00000001)
#define RCC_SYSCLKSource_HSE             ((uint32_t)0x00000002)
#define RCC_SYSCLKSource_PLLCLK          ((uint32_t)0x00000003)
#define IS_RCC_SYSCLK_SOURCE(SOURCE) (((SOURCE) == RCC_SYSCLKSource_MSI) || \
                                      ((SOURCE) == RCC_SYSCLKSource_HSI) || \
                                      ((SOURCE) == RCC_SYSCLKSource_HSE) || \
                                      ((SOURCE) == RCC_SYSCLKSource_PLLCLK))
/**
  * @}
  */ 
  
/** @defgroup RCC_AHB_Clock_Source
  * @{
  */
#define RCC_SYSCLK_Div1                  ((uint32_t)0x00000000)
#define RCC_SYSCLK_Div2                  ((uint32_t)0x00000080)
#define RCC_SYSCLK_Div4                  ((uint32_t)0x00000090)
#define RCC_SYSCLK_Div8                  ((uint32_t)0x000000A0)
#define RCC_SYSCLK_Div16                 ((uint32_t)0x000000B0)
#define RCC_SYSCLK_Div64                 ((uint32_t)0x000000C0)
#define RCC_SYSCLK_Div128                ((uint32_t)0x000000D0)
#define RCC_SYSCLK_Div256                ((uint32_t)0x000000E0)
#define RCC_SYSCLK_Div512                ((uint32_t)0x000000F0)
#define IS_RCC_HCLK(HCLK) (((HCLK) == RCC_SYSCLK_Div1) || ((HCLK) == RCC_SYSCLK_Div2) || \
                           ((HCLK) == RCC_SYSCLK_Div4) || ((HCLK) == RCC_SYSCLK_Div8) || \
                           ((HCLK) == RCC_SYSCLK_Div16) || ((HCLK) == RCC_SYSCLK_Div64) || \
                           ((HCLK) == RCC_SYSCLK_Div128) || ((HCLK) == RCC_SYSCLK_Div256) || \
                           ((HCLK) == RCC_SYSCLK_Div512))
/**
  * @}
  */ 
  

/** @defgroup RCC_I2C_clock_source 
  * @{
  */

#define RCC_I2C1CLK_PCLK                    ((uint32_t)0x10000000)
#define RCC_I2C1CLK_SYSCLK                  ((uint32_t)0x10001000)
#define RCC_I2C1CLK_HSI                     ((uint32_t)0x10002000)

#define RCC_I2C2CLK_PCLK                    ((uint32_t)0x20000000)
#define RCC_I2C2CLK_SYSCLK                  ((uint32_t)0x20004000)
#define RCC_I2C2CLK_HSI                     ((uint32_t)0x20008000)

#define RCC_I2C3CLK_PCLK                    ((uint32_t)0x30000000)
#define RCC_I2C3CLK_SYSCLK                  ((uint32_t)0x30010000)
#define RCC_I2C3CLK_HSI                     ((uint32_t)0x30020000)

#define IS_RCC_I2CCLK(I2CCLK) (((I2CCLK) == RCC_I2C1CLK_PCLK)   || ((I2CCLK) == RCC_I2C1CLK_SYSCLK) || \
                               ((I2CCLK) == RCC_I2C1CLK_HSI)    || ((I2CCLK) == RCC_I2C2CLK_PCLK) || \
                               ((I2CCLK) == RCC_I2C2CLK_SYSCLK) || ((I2CCLK) == RCC_I2C2CLK_HSI) || \
                               ((I2CCLK) == RCC_I2C3CLK_PCLK)   || ((I2CCLK) == RCC_I2C3CLK_SYSCLK) || \
                               ((I2CCLK) == RCC_I2C3CLK_HSI))

/**
  * @}
  */

/** @defgroup RCC_USART_clock_source 
  * @{
  */

#define RCC_USART1CLK_PCLK                  ((uint32_t)0x10000000)
#define RCC_USART1CLK_SYSCLK                ((uint32_t)0x10000001)
#define RCC_USART1CLK_HSI                   ((uint32_t)0x10000002)
#define RCC_USART1CLK_LSE                   ((uint32_t)0x10000003)

#define RCC_USART2CLK_PCLK                  ((uint32_t)0x20000000)
#define RCC_USART2CLK_SYSCLK                ((uint32_t)0x20000004)
#define RCC_USART2CLK_HSI                   ((uint32_t)0x20000008)
#define RCC_USART2CLK_LSE                   ((uint32_t)0x2000000C)

#define RCC_USART3CLK_PCLK                   ((uint32_t)0x30000000)
#define RCC_USART3CLK_SYSCLK                 ((uint32_t)0x30000010)
#define RCC_USART3CLK_HSI                    ((uint32_t)0x30000020)
#define RCC_USART3CLK_LSE                    ((uint32_t)0x30000030)

#define RCC_UART4CLK_PCLK                   ((uint32_t)0x40000000)
#define RCC_UART4CLK_SYSCLK                 ((uint32_t)0x40000040)
#define RCC_UART4CLK_HSI                    ((uint32_t)0x40000080)
#define RCC_UART4CLK_LSE                    ((uint32_t)0x400000C0)

#define RCC_UART5CLK_PCLK                   ((uint32_t)0x50000000)
#define RCC_UART5CLK_SYSCLK                 ((uint32_t)0x50000100)
#define RCC_UART5CLK_HSI                    ((uint32_t)0x50000200)
#define RCC_UART5CLK_LSE                    ((uint32_t)0x50000300)

#define RCC_LPUARTCLK_PCLK                  ((uint32_t)0x60000000)
#define RCC_LPUARTCLK_SYSCLK                ((uint32_t)0x60000400)
#define RCC_LPUARTCLK_HSI                   ((uint32_t)0x60000800)
#define RCC_LPUARTCLK_LSE                   ((uint32_t)0x60000C00)

#define IS_RCC_USARTCLK(USARTCLK) (((USARTCLK) == RCC_USART1CLK_PCLK) || ((USARTCLK) == RCC_USART1CLK_SYSCLK) || \
                                   ((USARTCLK) == RCC_USART1CLK_LSE) || ((USARTCLK) == RCC_USART1CLK_HSI) ||\
                                   ((USARTCLK) == RCC_USART2CLK_PCLK) || ((USARTCLK) == RCC_USART2CLK_SYSCLK) || \
                                   ((USARTCLK) == RCC_USART2CLK_LSE) || ((USARTCLK) == RCC_USART2CLK_HSI) || \
                                   ((USARTCLK) == RCC_USART3CLK_PCLK) || ((USARTCLK) == RCC_USART3CLK_SYSCLK) || \
                                   ((USARTCLK) == RCC_USART3CLK_LSE) || ((USARTCLK) == RCC_USART3CLK_HSI) || \
                                   ((USARTCLK) == RCC_UART4CLK_PCLK) || ((USARTCLK) == RCC_UART4CLK_SYSCLK) || \
                                   ((USARTCLK) == RCC_UART4CLK_LSE) || ((USARTCLK) == RCC_UART4CLK_HSI) ||\
                                   ((USARTCLK) == RCC_UART5CLK_PCLK) || ((USARTCLK) == RCC_UART5CLK_SYSCLK) || \
                                   ((USARTCLK) == RCC_UART5CLK_LSE) || ((USARTCLK) == RCC_UART5CLK_HSI) || \
                                   ((USARTCLK) == RCC_LPUARTCLK_PCLK) || ((USARTCLK) == RCC_LPUARTCLK_SYSCLK) || \
                                   ((USARTCLK) == RCC_LPUARTCLK_LSE) || ((USARTCLK) == RCC_LPUARTCLK_HSI))
/**
  * @}
  */


/** @defgroup RCC_LPTIM_clock_source 
  * @{
  */

#define RCC_LPTIM1CLKSource_APB                     ((uint32_t)0x10000000)
#define RCC_LPTIM1CLKSource_LSI                     ((uint32_t)0x10040000)
#define RCC_LPTIM1CLKSource_HSI                     ((uint32_t)0x10080000)
#define RCC_LPTIM1CLKSource_LSE                     ((uint32_t)0x100C0000)

#define RCC_LPTIM2CLKSource_APB                     ((uint32_t)0x20000000)
#define RCC_LPTIM2CLKSource_LSI                     ((uint32_t)0x20100000)
#define RCC_LPTIM2CLKSource_HSI                     ((uint32_t)0x20200000)
#define RCC_LPTIM2CLKSource_LSE                     ((uint32_t)0x20300000)

#define IS_RCC_LPTIM(CLK)      (((CLK) == RCC_LPTIM1CLKSource_APB) || ((CLK) == RCC_LPTIM1CLKSource_LSI) || \
                               ((CLK) == RCC_LPTIM1CLKSource_HSI)  || ((CLK) == RCC_LPTIM1CLKSource_LSE) || \
                               ((CLK) == RCC_LPTIM2CLKSource_APB)  || ((CLK) == RCC_LPTIM2CLKSource_LSI) || \
                               ((CLK) == RCC_LPTIM2CLKSource_HSI)  || ((CLK) == RCC_LPTIM2CLKSource_LSE))
/**
  * @}
  */

/** @defgroup RCC_ADC_Clock_Source
  * @{
  */
#define RCC_ADCCLKSource_PLLSAI1               ((uint32_t)0x10000000)    /*!<  RCC PLL_SAI1 "R" clock selected as SAR ADCs clock */
#define RCC_ADCCLKSource_PLLSAI2               ((uint32_t)0x20000000)    /*!<  RCC PLL_SAI2 "R" clock selected as SAR ADCs clock */
#define RCC_ADCCLKSource_SYSCLK                ((uint32_t)0x30000000)    /*!<  System clock selected as SAR ADCs clock */

#define IS_RCC_ADC_CLOCK(CLOCK)      (((CLOCK) == RCC_ADCCLKSource_PLLSAI1) || \
                                      ((CLOCK) == RCC_ADCCLKSource_PLLSAI2) || \
                                      ((CLOCK) == RCC_ADCCLKSource_SYSCLK))
/**
  * @}
  */ 


/** @defgroup RCC_DFSDM_Clock_Source
  * @{
  */
#define RCC_DFSDMCLKSource_APB             ((uint8_t)0x00)
#define RCC_DFSDMCLKSource_SYS             ((uint8_t)0x01)

