RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Includes/Library_Files/stm32l4xx_rcc.h
#define IS_RCC_DFSDMCLK_SOURCE(SOURCE) (((SOURCE) == RCC_DFSDMCLKSource_APB) || ((SOURCE) == RCC_DFSDMCLKSource_SYS))  


/**
  * @}
  */ 


/** @defgroup RCC_SWP_Clock_Source
  * @{
  */
#define RCC_SWPCLKSource_APB             ((uint8_t)0x00)
#define RCC_SWPCLKSource_HSI             ((uint8_t)0x01)

#define IS_RCC_SWPCLK_SOURCE(SOURCE) (((SOURCE) == RCC_SWPCLKSource_APB) || ((SOURCE) == RCC_SWPCLKSource_HSI))  


/**
  * @}
  */ 


/** @defgroup RCC_SAI_clock_source 
  * @{
  */

#define RCC_SAI1CLK_PLLSAI1                   ((uint32_t)0x10000000)
#define RCC_SAI1CLK_PLLSAI2                   ((uint32_t)0x10400000)
#define RCC_SAI1CLK_PLLSYS                    ((uint32_t)0x10800000)
#define RCC_SAI1CLK_PIN                       ((uint32_t)0x10C00000)

#define RCC_SAI2CLK_PLLSAI1                   ((uint32_t)0x20000000)
#define RCC_SAI2CLK_PLLSAI2                   ((uint32_t)0x21000000)
#define RCC_SAI2CLK_PLLSYS                    ((uint32_t)0x22000000)
#define RCC_SAI2CLK_PIN                       ((uint32_t)0x23000000)


#define IS_RCC_SAICLK(SAICLK)  (((SAICLK) == RCC_SAI1CLK_PLLSAI1)  || ((SAICLK) == RCC_SAI1CLK_PLLSAI2) || \
                               ((SAICLK) == RCC_SAI1CLK_PIN)       || ((SAICLK) == RCC_SAI1CLK_PLLSYS)  || \
                               ((SAICLK) == RCC_SAI2CLK_PLLSAI1)   || ((SAICLK) == RCC_SAI2CLK_PLLSAI2) || \
                               ((SAICLK) == RCC_SAI2CLK_PLLSYS)    || ((SAICLK) == RCC_SAI2CLK_PIN)) 
                               
/**
  * @}
  */

/** @defgroup RCC_CLK48_clock_source 
  * @{
  */

#define RCC_CLK48Source_PLLSAI1                  ((uint32_t)0x04000000)
#define RCC_CLK48Source_PLLSYS                   ((uint32_t)0x08000000)
#define RCC_CLK48Source_MSI                      ((uint32_t)0x0C000000)


#define IS_RCC_CLK48(CLK48)  (((CLK48) == RCC_CLK48Source_PLLSAI1)  || ((CLK48) == RCC_CLK48Source_PLLSYS) || \
                              ((CLK48) == RCC_CLK48Source_MSI))
                               
/**
  * @}
  */
/** @defgroup RCC_APB1_APB2_Clock_Source
  * @{
  */
#define RCC_HCLK_Div1                    ((uint32_t)0x00000000)
#define RCC_HCLK_Div2                    ((uint32_t)0x00000400)
#define RCC_HCLK_Div4                    ((uint32_t)0x00000500)
#define RCC_HCLK_Div8                    ((uint32_t)0x00000600)
#define RCC_HCLK_Div16                   ((uint32_t)0x00000700)
#define IS_RCC_PCLK(PCLK) (((PCLK) == RCC_HCLK_Div1) || ((PCLK) == RCC_HCLK_Div2) || \
                           ((PCLK) == RCC_HCLK_Div4) || ((PCLK) == RCC_HCLK_Div8) || \
                           ((PCLK) == RCC_HCLK_Div16))
/**
  * @}
  */ 
  
/** @defgroup RCC_Interrupt_Source 
  * @{
  */
#define RCC_IT_LSIRDY                    ((uint32_t)0x00000001)
#define RCC_IT_LSERDY                    ((uint32_t)0x00000002)
#define RCC_IT_MSIRDY                    ((uint32_t)0x00000004)
#define RCC_IT_HSIRDY                    ((uint32_t)0x00000008)
#define RCC_IT_HSERDY                    ((uint32_t)0x00000010)
#define RCC_IT_PLLRDY                    ((uint32_t)0x00000020)
#define RCC_IT_PLLSAI1RDY                ((uint32_t)0x00000040)
#define RCC_IT_PLLSAI2RDY                ((uint32_t)0x00000080)
#define RCC_IT_HSECSS                    ((uint32_t)0x00000100)
#define RCC_IT_LSECSS                    ((uint32_t)0x00000200)


#define IS_RCC_IT(IT) (((IT) == RCC_IT_LSIRDY) || ((IT) == RCC_IT_LSERDY) || \
                           ((IT) == RCC_IT_HSIRDY) || ((IT) == RCC_IT_MSIRDY) || \
                           ((IT) == RCC_IT_PLLRDY) || ((IT) == RCC_IT_HSERDY) || \
                           ((IT) == RCC_IT_PLLSAI1RDY) || ((IT) == RCC_IT_PLLSAI2RDY)|| \
                           ((IT) == RCC_IT_LSECSS))

#define IS_RCC_GET_IT(IT) (((IT) == RCC_IT_LSIRDY) || ((IT) == RCC_IT_LSERDY) || \
                           ((IT) == RCC_IT_HSIRDY) || ((IT) == RCC_IT_MSIRDY) || \
                           ((IT) == RCC_IT_PLLRDY) || ((IT) == RCC_IT_HSERDY) || \
                           ((IT) == RCC_IT_PLLSAI1RDY) || ((IT) == RCC_IT_PLLSAI2RDY)|| \
                           ((IT) == RCC_IT_LSECSS)|| ((IT) == RCC_IT_HSECSS))


#define IS_RCC_CLEAR_IT(IT) (((IT) == RCC_IT_LSIRDY) || ((IT) == RCC_IT_LSERDY) || \
                           ((IT) == RCC_IT_HSIRDY) || ((IT) == RCC_IT_MSIRDY) || \
                           ((IT) == RCC_IT_PLLRDY) || ((IT) == RCC_IT_HSERDY) || \
                           ((IT) == RCC_IT_PLLSAI1RDY) || ((IT) == RCC_IT_PLLSAI2RDY)|| \
                           ((IT) == RCC_IT_LSECSS)|| ((IT) == RCC_IT_HSECSS))


/**
  * @}
  */ 
  
/** @defgroup RCC_LSE_Configuration 
  * @{
  */
#define RCC_LSE_OFF                      ((uint8_t)0x00)
#define RCC_LSE_ON                       ((uint8_t)0x01)
#define RCC_LSE_Bypass                   ((uint8_t)0x04)
#define IS_RCC_LSE(LSE) (((LSE) == RCC_LSE_OFF) || ((LSE) == RCC_LSE_ON) || \
                         ((LSE) == RCC_LSE_Bypass))
/**
  * @}
  */ 
  
/** @defgroup RCC_RTC_Clock_Source
  * @{
  */
#define RCC_RTCCLKSource_LSE             ((uint32_t)0x00000100)
#define RCC_RTCCLKSource_LSI             ((uint32_t)0x00000200)
#define RCC_RTCCLKSource_HSE             ((uint32_t)0x00000300)

#define IS_RCC_RTCCLK_SOURCE(SOURCE) (((SOURCE) == RCC_RTCCLKSource_LSE) || \
                                      ((SOURCE) == RCC_RTCCLKSource_LSI) || \
                                      ((SOURCE) == RCC_RTCCLKSource_HSE) )
                                     

/** @defgroup RCC_TIM_PRescaler_Selection
  * @{
  */
#define RCC_TIMPrescDesactivated             ((uint8_t)0x00)
#define RCC_TIMPrescActivated                ((uint8_t)0x01)

#define IS_RCC_TIMCLK_PRESCALER(VALUE) (((VALUE) == RCC_TIMPrescDesactivated) || ((VALUE) == RCC_TIMPrescActivated))
/**
  * @}
  */
  
/** @defgroup RCC_AHB1_Peripherals 
  * @{
  */ 
#define  RCC_AHB1Periph_DMA1                ((uint32_t)0x00000001)
#define  RCC_AHB1Periph_DMA2                ((uint32_t)0x00000002)
#define  RCC_AHB1Periph_FLASH               ((uint32_t)0x00000100)
#define  RCC_AHB1Periph_SRAM1               ((uint32_t)0x00000200)
#define  RCC_AHB1Periph_CRC                 ((uint32_t)0x00001000)
#define  RCC_AHB1Periph_TSC                 ((uint32_t)0x00010000)


#define IS_RCC_AHB1_CLOCK_PERIPH(PERIPH) ((((PERIPH) & 0xFFFEEEFC) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_AHB1_LPMODE_PERIPH(PERIPH) ((((PERIPH)& 0xFFFEECFC) == 0x00) && ((PERIPH) != 0x00))


/**
  * @}
  */ 
  
/** @defgroup RCC_AHB2_Peripherals 
  * @{
  */  
#define  RCC_AHB2Periph_GPIOA                 ((uint32_t)0x00000001)
#define  RCC_AHB2Periph_GPIOB                 ((uint32_t)0x00000002)
#define  RCC_AHB2Periph_GPIOC                 ((uint32_t)0x00000004)
#define  RCC_AHB2Periph_GPIOD                 ((uint32_t)0x00000008)
#define  RCC_AHB2Periph_GPIOE                 ((uint32_t)0x00000010)
#define  RCC_AHB2Periph_GPIOF                 ((uint32_t)0x00000020)
#define  RCC_AHB2Periph_GPIOG                 ((uint32_t)0x00000040)
#define  RCC_AHB2Periph_GPIOH                 ((uint32_t)0x00000080)
#define  RCC_AHB2Periph_SRAM2                 ((uint32_t)0x00000200)
#define  RCC_AHB2Periph_OTGFS                 ((uint32_t)0x00001000)
#define  RCC_AHB2Periph_ADC                   ((uint32_t)0x00002000)
#define  RCC_AHB2Periph_AES                   ((uint32_t)0x00010000)
#define  RCC_AHB2Periph_RNG                   ((uint32_t)0x00040000)


#define IS_RCC_AHB2_PERIPH(PERIPH) ((((PERIPH) & 0xFFFACF00) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_AHB2_LPMODE_PERIPH(PERIPH) ((((PERIPH)& 0xFFFA8D00) == 0x00) && ((PERIPH) != 0x00))

/**
  * @}
  */ 
  
/** @defgroup RCC_AHB3_Peripherals 
  * @{
  */ 
#define  RCC_AHB3Periph_FMC                ((uint32_t)0x00000001)
#define  RCC_AHB3Periph_QSPI               ((uint32_t)0x00000100)
#define  IS_RCC_AHB3_PERIPH(PERIPH) ((((PERIPH) & 0xFFFFFEFE) == 0x00) && ((PERIPH) != 0x00))
/**
  * @}
  */ 
  
/** @defgroup RCC_APB1_Peripherals 
  * @{
  */ 
#define  RCC_APB1LPeriph_TIM2                ((uint32_t)0x00000001)
#define  RCC_APB1LPeriph_TIM3                ((uint32_t)0x00000002)
#define  RCC_APB1LPeriph_TIM4                ((uint32_t)0x00000004)
#define  RCC_APB1LPeriph_TIM5                ((uint32_t)0x00000008)
#define  RCC_APB1LPeriph_TIM6                ((uint32_t)0x00000010)
#define  RCC_APB1LPeriph_TIM7                ((uint32_t)0x00000020)
#define  RCC_APB1LPeriph_LCD                 ((uint32_t)0x00000200)
#define  RCC_APB1LPeriph_WWDG                ((uint32_t)0x00000800)
#define  RCC_APB1LPeriph_SPI2                ((uint32_t)0x00004000)
#define  RCC_APB1LPeriph_SPI3                ((uint32_t)0x00008000)
#define  RCC_APB1LPeriph_USART2              ((uint32_t)0x00020000)
#define  RCC_APB1LPeriph_USART3              ((uint32_t)0x00040000)
#define  RCC_APB1LPeriph_UART4               ((uint32_t)0x00080000)
#define  RCC_APB1LPeriph_UART5               ((uint32_t)0x00100000)
#define  RCC_APB1LPeriph_I2C1                ((uint32_t)0x00200000)
#define  RCC_APB1LPeriph_I2C2                ((uint32_t)0x00400000)
#define  RCC_APB1LPeriph_I2C3                ((uint32_t)0x00800000)
#define  RCC_APB1LPeriph_CAN                 ((uint32_t)0x02000000)
#define  RCC_APB1LPeriph_PWR                 ((uint32_t)0x10000000)
#define  RCC_APB1LPeriph_DAC                 ((uint32_t)0x20000000)
#define  RCC_APB1LPeriph_OPAMP               ((uint32_t)0x40000000)
#define  RCC_APB1LPeriph_LPTIM1              ((uint32_t)0x80000000)


#define IS_RCC_APB1L_PERIPH(PERIPH) ((((PERIPH) &0xD0135C0) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_APB1L_RESET_PERIPH(PERIPH) ((((PERIPH) &0xD013DC0) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_APB1L_LP_PERIPH(PERIPH)     IS_RCC_APB1L_PERIPH(PERIPH)


/**
  * @}
  */ 
  

/** @defgroup RCC_APB2_Peripherals 
  * @{
  */ 


#define  RCC_APB1HPeriph_LPUART               ((uint32_t)0x00000001)
#define  RCC_APB1HPeriph_SWP                  ((uint32_t)0x00000004)
#define  RCC_APB1HPeriph_LPTIM2               ((uint32_t)0x00000020)

#define IS_RCC_APB1H_PERIPH(PERIPH) ((((PERIPH) & 0xFFFFFFDA) == 0x00) && ((PERIPH) != 0x00))

/** @defgroup RCC_APB2_Peripherals 
  * @{
  */ 
#define  RCC_APB2Periph_SYSCFG                ((uint32_t)0x00000001)
#define  RCC_APB2Periph_COMP                  ((uint32_t)0x00000001)
#define  RCC_APB2Periph_FIREWALL              ((uint32_t)0x00000080)
#define  RCC_APB2Periph_SDIO                  ((uint32_t)0x00000400)
#define  RCC_APB2Periph_TIM1                  ((uint32_t)0x00000800)
#define  RCC_APB2Periph_SPI1                  ((uint32_t)0x00001000)
#define  RCC_APB2Periph_TIM8                  ((uint32_t)0x00002000)
#define  RCC_APB2Periph_USART1                ((uint32_t)0x00004000)
#define  RCC_APB2Periph_TIM15                 ((uint32_t)0x00010000)
#define  RCC_APB2Periph_TIM16                 ((uint32_t)0x00020000)
#define  RCC_APB2Periph_TIM17                 ((uint32_t)0x00040000)
#define  RCC_APB2Periph_SAI1                  ((uint32_t)0x00200000)
#define  RCC_APB2Periph_SAI2                  ((uint32_t)0x00400000)
#define  RCC_APB2Periph_DFSDM                 ((uint32_t)0x01000000)


#define IS_RCC_APB2_PERIPH(PERIPH) ((((PERIPH) & 0xFE98837E) == 0x00) && ((PERIPH) != 0x00))
#define IS_RCC_APB2_RESET_PERIPH(PERIPH) ((((PERIPH) & 0xFE9883FE) == 0x00) && ((PERIPH) != 0x00))

/**
  * @}
  */ 
  
/** @defgroup RCC_MCO1_Clock_Source_Prescaler
  * @{
  */
#define RCC_MCOSource_SYSCLK            ((uint32_t)0x01000000)
#define RCC_MCOSource_MSI               ((uint32_t)0x02000000)
#define RCC_MCOSource_HSI               ((uint32_t)0x03000000)
#define RCC_MCOSource_HSE               ((uint32_t)0x04000000)
#define RCC_MCOSource_PLLCLK            ((uint32_t)0x05000000)
#define RCC_MCOSource_LSI               ((uint32_t)0x06000000)
#define RCC_MCOSource_LSE               ((uint32_t)0x07000000)    
    
#define RCC_MCODiv_1                    ((uint32_t)0x00000000)
#define RCC_MCODiv_2                    ((uint32_t)0x10000000)
#define RCC_MCODiv_4                    ((uint32_t)0x20000000)
#define RCC_MCODiv_8                    ((uint32_t)0x30000000)
#define RCC_MCODiv_16                   ((uint32_t)0x40000000)
    
