RT-Thread-Studio/sdk-bsp-stm32h750-realthread-artpi/tools/st_link/ST-LINK/tools/bin/ExternalLoader/N25Q256A_STM32L476G-EVAL/Includes/Library_Files/stm32l4xx_rcc.h
#define IS_RCC_MCOSOURCE(SOURCE) (((SOURCE) == RCC_MCOSource_SYSCLK) || ((SOURCE) == RCC_MCOSource_MSI) || \
                                   ((SOURCE) == RCC_MCOSource_HSI) || ((SOURCE) == RCC_MCOSource_HSE) \
                                   || ((SOURCE) == RCC_MCOSource_PLLCLK) || ((SOURCE) == RCC_MCOSource_LSI) \
                                   || ((SOURCE) == RCC_MCOSource_LSE))
    
#define IS_RCC_MCODIV(DIV) (((DIV) == RCC_MCODiv_1) || ((DIV) == RCC_MCODiv_2) || \
                             ((DIV) == RCC_MCODiv_4) || ((DIV) == RCC_MCODiv_8) || \
                             ((DIV) == RCC_MCODiv_16)) 

/**
  * @}
  */ 
  
/** @defgroup RCC_Flag 
  * @{
  */
#define RCC_FLAG_MSIRDY                  ((uint8_t)0x21)
#define RCC_FLAG_HSIRDY                  ((uint8_t)0x2A)
#define RCC_FLAG_HSERDY                  ((uint8_t)0x31)
#define RCC_FLAG_PLLRDY                  ((uint8_t)0x39)
#define RCC_FLAG_PLLSAI1RDY              ((uint8_t)0x3B)
#define RCC_FLAG_PLLSAI2RDY              ((uint8_t)0x3D)

#define RCC_FLAG_LSERDY                  ((uint8_t)0x41)
#define RCC_FLAG_LSIRDY                  ((uint8_t)0x61)

#define RCC_FLAG_RMVF                    ((uint8_t)0x77)
#define RCC_FLAG_FIREWALLRST             ((uint8_t)0x78)
#define RCC_FLAG_OBLRST                  ((uint8_t)0x79)
#define RCC_FLAG_PINRST                  ((uint8_t)0x7A)
#define RCC_FLAG_PORRST                  ((uint8_t)0x7B)
#define RCC_FLAG_SFTRST                  ((uint8_t)0x7C)
#define RCC_FLAG_IWDGRST                 ((uint8_t)0x7D)
#define RCC_FLAG_WWDGRST                 ((uint8_t)0x7E)
#define RCC_FLAG_LPWRRST                 ((uint8_t)0x7F)


#define IS_RCC_FLAG(FLAG) (((FLAG) == RCC_FLAG_MSIRDY)     || ((FLAG) == RCC_FLAG_HSIRDY) || \
                           ((FLAG) == RCC_FLAG_HSERDY)     || ((FLAG) == RCC_FLAG_PLLRDY) || \
                           ((FLAG) == RCC_FLAG_PLLSAI1RDY) || ((FLAG) == RCC_FLAG_PLLSAI2RDY) || \
                           ((FLAG) == RCC_FLAG_LSERDY)     || ((FLAG) == RCC_FLAG_LSIRDY) || \
                           ((FLAG) == RCC_FLAG_RMVF)       || ((FLAG) == RCC_FLAG_FIREWALLRST)|| \
                           ((FLAG) == RCC_FLAG_OBLRST)     || ((FLAG) == RCC_FLAG_PINRST)|| \
                           ((FLAG) == RCC_FLAG_PORRST)     || ((FLAG) == RCC_FLAG_SFTRST)|| \
                           ((FLAG) == RCC_FLAG_IWDGRST)    || ((FLAG) == RCC_FLAG_WWDGRST)|| \
                           ((FLAG) == RCC_FLAG_LPWRRST))

#define IS_RCC_HSI_CALIBRATION_VALUE(VALUE) ((VALUE) <= 0x1F)
#define IS_RCC_MSI_CALIBRATION_VALUE(VALUE) ((VALUE) <= 0xFF)
/**
  * @}
  */ 

/**
  * @}
  */ 

/* Exported macro ------------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/ 

/* Function used to set the RCC clock configuration to the default reset state */
void RCC_DeInit(void);

/* Internal/external clocks, PLL, CSS and MCO configuration functions *********/
void        RCC_HSEConfig(uint8_t RCC_HSE);
ErrorStatus RCC_WaitForHSEStartUp(void);
void RCC_MSIRangeConfig(uint32_t RCC_MSIRange);
void RCC_MSIStandbyRangeConfig(uint32_t RCC_MSIRange);
void RCC_AdjustMSICalibrationValue(uint32_t MSICalibrationValue);
void RCC_MSICmd(FunctionalState NewState);
void        RCC_AdjustHSICalibrationValue(uint32_t HSICalibrationValue);
void        RCC_HSICmd(FunctionalState NewState);
void        RCC_LSEConfig(uint8_t RCC_LSE);
void        RCC_LSICmd(FunctionalState NewState);

void RCC_PLLConfig(uint32_t RCC_PLLSource, uint32_t PLLM, uint32_t PLLN, uint32_t PLLP, uint32_t PLLQ , uint32_t PLLR);
void RCC_PLLCmd(FunctionalState NewState);
void RCC_PLLClockOutCmd(uint32_t RCC_PLLClockOut, FunctionalState NewState);

void RCC_PLLSAI1Config(uint32_t PLLSAI1N, uint32_t PLLSAI1P,uint32_t PLLSAI1Q, uint32_t PLLSAI1R);
void RCC_PLLSAI1Cmd(FunctionalState NewState);
void RCC_PLLSAI1ClockOutCmd(uint32_t RCC_PLLSAI1ClockOut, FunctionalState NewState);

void RCC_PLLSAI2Config(uint32_t PLLSAIN,uint32_t PLLSAI1P, uint32_t PLLSAI2Q, uint32_t PLLSAI2R);
void RCC_PLLSAI2Cmd(FunctionalState NewState);
void RCC_PLLSAI2ClockOutCmd(uint32_t RCC_PLLSAI2ClockOut, FunctionalState NewState);

void RCC_HSEClockSecuritySystemCmd(FunctionalState NewState);
void RCC_LSEClockSecuritySystemCmd(FunctionalState NewState);
void RCC_StopWakeUpClock(uint32_t RCC_STOPWUCK_Clock);
void RCC_MCOConfig(uint32_t RCC_MCOSource, uint32_t RCC_MCODiv);
/* System, AHB and APB busses clocks configuration functions ******************/
void    RCC_SYSCLKConfig(uint32_t RCC_SYSCLKSource);
uint8_t RCC_GetSYSCLKSource(void);
void    RCC_HCLKConfig(uint32_t RCC_SYSCLK);
void    RCC_PCLK1Config(uint32_t RCC_HCLK);
void    RCC_PCLK2Config(uint32_t RCC_HCLK);
void    RCC_GetClocksFreq(RCC_ClocksTypeDef* RCC_Clocks);

/* Peripheral clocks configuration functions **********************************/
void RCC_RTCCLKConfig(uint32_t RCC_RTCCLKSource);
void RCC_RTCCLKCmd(FunctionalState NewState);
void RCC_BackupResetCmd(FunctionalState NewState);
void RCC_I2CCLKConfig(uint32_t RCC_I2CCLK);
void RCC_USARTCLKConfig(uint32_t RCC_USARTCLK);
void RCC_LPTIMCLKConfig(uint32_t RCC_LPTIMxCLKSource);
void RCC_ADCCLKConfig(uint32_t RCC_ADCCLKSource);
void RCC_DFSDMCLKConfig(uint32_t RCC_DFSDMCLKSource);
void RCC_SWPCLKConfig(uint32_t RCC_SWPCLKSource);
void RCC_SAICLKConfig(uint32_t RCC_SAICLKSource);
void RCC_CLK48Config(uint32_t RCC_CLK48Source);

void RCC_TIMCLKPresConfig(uint32_t RCC_TIMCLKPrescaler);

void RCC_AHB1PeriphClockCmd(uint32_t RCC_AHB1Periph, FunctionalState NewState);
void RCC_AHB2PeriphClockCmd(uint32_t RCC_AHB2Periph, FunctionalState NewState);
void RCC_AHB3PeriphClockCmd(uint32_t RCC_AHB3Periph, FunctionalState NewState);
void RCC_APB1LPeriphClockCmd(uint32_t RCC_APB1LPeriph, FunctionalState NewState);
void RCC_APB1HPeriphClockCmd(uint32_t RCC_APB1HPeriph, FunctionalState NewState);
void RCC_APB2PeriphClockCmd(uint32_t RCC_APB2Periph, FunctionalState NewState);

void RCC_AHB1PeriphResetCmd(uint32_t RCC_AHB1Periph, FunctionalState NewState);
void RCC_AHB2PeriphResetCmd(uint32_t RCC_AHB2Periph, FunctionalState NewState);
void RCC_AHB3PeriphResetCmd(uint32_t RCC_AHB3Periph, FunctionalState NewState);
void RCC_APB1LPeriphResetCmd(uint32_t RCC_APB1LPeriph, FunctionalState NewState);
void RCC_APB1HPeriphResetCmd(uint32_t RCC_APB1HPeriph, FunctionalState NewState);
void RCC_APB2PeriphResetCmd(uint32_t RCC_APB2Periph, FunctionalState NewState);

void RCC_AHB1PeriphClockLPModeCmd(uint32_t RCC_AHB1Periph, FunctionalState NewState);
void RCC_AHB2PeriphClockLPModeCmd(uint32_t RCC_AHB2Periph, FunctionalState NewState);
void RCC_AHB3PeriphClockLPModeCmd(uint32_t RCC_AHB3Periph, FunctionalState NewState);
void RCC_APB1LPeriphClockLPModeCmd(uint32_t RCC_APB1LPeriph, FunctionalState NewState);
void RCC_APB1HPeriphClockLPModeCmd(uint32_t RCC_APB1HPeriph, FunctionalState NewState);
void RCC_APB2PeriphClockLPModeCmd(uint32_t RCC_APB2Periph, FunctionalState NewState);

/* Interrupts and flags management functions **********************************/
void       RCC_ITConfig(uint32_t RCC_IT, FunctionalState NewState);
FlagStatus RCC_GetFlagStatus(uint32_t RCC_FLAG);
void       RCC_ClearFlag(void);
ITStatus   RCC_GetITStatus(uint32_t RCC_IT);
void       RCC_ClearITPendingBit(uint32_t RCC_IT);

#ifdef __cplusplus
}
#endif

#endif /* __STM32L4xx_RCC_H */

/**
  * @}
  */ 

/**
  * @}
  */ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
